Revit 2027 API
TessellatedBuildIssueType Enumeration
 Types of issues encountered while constructing geometrical objects from the tessellatted face sets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TessellatedBuildIssueType
Public Enumeration TessellatedBuildIssueType
public enum class TessellatedBuildIssueType
type TessellatedBuildIssueType
Members
Member name | Value | Description
AllFine | 0 |  No issues were encountered. Issues of this type should not be present in TessellatedShapeBuilderResult.
DegenOriginalLoop | 18 |  A degenerate face loop is degenerate. Associated numbers are face and loop indices respectively.
EdgeTraversalForFlip | 24 |  A face edge with topological problems. Associated numbers are indices of the face, loop and vertex and an index of another involved face respectively.
EdgeTwiceUsedByFace | 20 |  A face with an edge encountered in the loops multiple times. Associated numbers are face and loop in which the problem became obvious indices respectively.
EmptyFace | 1 |  A face which does not have any loops. An associated number is face index.
EmptyLoop | 2 |  A face loop which does not have any points. Associated numbers are face index and loop index respectively.
FaceWithIslands | 15 |  A face which has a loop inside a loop inside a loop. Associated numbers are face and three loop indices respectively.
InconsistentInnerOuterOriginalLoopCCW | 19 |  A face where the CCW of inner loop is inconsistent with CCW of the outer loop. Associated numbers are face and inner loop indices respectively.
InconsitentMultiEdgeTraversalForFlip | 25 |  A face edge with topological problems. Associated numbers are indices of the involved faces.
InternalError | 28 |  An internal Revit problem. Issues of this type should not be present in TessellatedShapeBuilderResult. Please notify Autodesk support if encountered. Associated number is face index.
InternalLightError | 29 |  An internal Revit problem. Issues of this type should not be present in TessellatedShapeBuilderResult. Please notify Autodesk support if encountered. Associated number is face index.
InternalMissingError | 30 |  An internal Revit problem. Issues of this type should not be present in TessellatedShapeBuilderResult. Please notify Autodesk support if encountered. Associated number is face index.
InternalUtilityError | 27 |  An internal Revit problem. Issues of this type should not be present in TessellatedShapeBuilderResult. Please notify Autodesk support if encountered.
IntersectingOriginalLoops | 14 |  A face whose loops intersect. Associated numbers are face and two loop indices respectively.
LoopOnBestFitSelfIntersects | 13 |  A face loop whose projection of the best-fit-plane self-intersects. Associated numbers are face, loop, and two segments indices respectively.
LostAllLoops | 9 |  A face, which originally had enough loops lost all of them during purges. An associated number is face index.
LostTooManyLoopVertices | 6 |  A face loop, which originally had enough vertices, but lost too many of them, while purging pseudo-duplicates. Associated numbers are face index and loop index respectively.
NonManifoldEdge | 21 |  Same edge is used by more than two faces. This issue can be posted for topologically impossible face sets as well as for face sets with duplicate faces. Associated numbers are face and loop in which the problem became obvious indices respectively.
NonPlanarFace | 10 |  A face which is not planar. An associated number is face index.
NotSetYet | 32 |  An issue has not been set yet.
NumberOfIssueTypes | 33 |  Not a code of some issue, but the number of known types of issues. Issues of this type should not be present in TessellatedShapeBuilderResult. Please notify Autodesk support if encountered
OriginalLoopGeomAcuteAngle | 7 |  A face loop with a too acute angle between adjacent segments. This condition is not relevant for polymesh construction. Associated numbers are face, loop and point between segments indices respectively.
OriginalLoopMeshAcuteAngle | 8 |  A face loop with a too acute angle between adjacent segments. This condition is not relevant for polymesh construction. Associated numbers are face, loop and point between segments indices respectively.
OriginalLoopsProximity | 16 |  A face with excessive proximity between face loops. Associated numbers are face and two loop indices respectively.
OriginalPointsTooFarFromTheirPlane | 11 |  A face whose original points taken together do define a plane, but some of them lie to far from it. An associated number is face index.
OuterLoopIsNotFirst | 17 |  A face have multiple loops, but the outer loop is not listed as the very first one. Associated numbers are face and loop indices respectively.
OverlappingAdjacentFaces | 22 |  Adjacent faces which either exactly overlaps or have a too acute angle between them. This issue can be reported for face sets with duplicate faces as well. Associated numbers are face and loop indices of one face and face and loop indices of another face respectively.
PartitionPointsTooFarFromTrueEdge | 23 |  Points representing partitions of input points are too far from the true edge. Associated numbers are face and loop indices, an index of the vertex in the beginning of the segment which is too far from the corresponding true edge, an index of another involved face respectively.
TooFewOriginalVertices | 3 |  A face loop, which from the very beginning does not have enough points. Associated numbers are face index and loop index respectively.
TooShortOriginalLoopGeomSegment | 5 |  A face loop, containing a segment which is too short for a geometry, but not for a mesh. Associated numbers are face, loop and point indices respectively (the segment goes from the previous point to this one).
TooShortOriginalLoopMeshSegment | 4 |  A face loop, containing a segment which is too short even for a mesh. Associated numbers are face, loop and point indices respectively (the segment goes from the previous point to this one).
TooSmallVertexSegementDistInFinalLoop | 26 |  A face loop with too small vertex-segment distance. Associated numbers are face, loop, segment and vertex indices respectively
TooSmallVertexSegementDistInOriginalLoop | 12 |  A face loop with too small vertex-segment distance. Associated numbers are face, loop, segment and vertex indices respectively.
UnarticulatedNonManifoldEdge | 31 |  An input face is mising an edge conecting two non-adjacent vertices from its boundaries, which are adjacent in the boundaries of some other face(s). If such an edge would be added, it would split the face and result in 'NonManifoldEdge' or other issues. Associated numbers are indices of a face which misses an edge and indices of one or two faces in which boundaries such edge is present.
See Also
Reference
Autodesk.Revit.DB Namespace